Autodesk.Revit.DB.BuiltInFailures.FormFailures.VoidFormsNotUsed
Some Void Forms of this family do not cut anything and will be deleted. To make a Void Form cut something else use the Cut Geometry tool.

Autodesk.Revit.DB.BuiltInFailures.FormFailures.OpenProfileMultiSegmentSweepsNotSupported
An open profile cannot be swept along a multi-segment path.

Autodesk.Revit.DB.BuiltInFailures.FormFailures.NoSoludGeometryForVoidFormsInMass
This Mass has no solid geometry for its Void Forms to cut. They must be deleted, or solid geometry added and cut.

Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormElemRegenSelfIntersectionResetConnections
This form cannot be created due to self-intersecting geometry. Clicking the Reset Connections button will attempt to solve this problem.

Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormElemRegenSelfIntersectionReorderProfiles
This form cannot be created due to self-intersecting geometry. Clicking the Reorder Profiles button will attempt to solve this problem.

Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormElemRegenSelfIntersection
Unable to create form element: self-intersecting or singular geometry would result.

Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormElemRegenFailureError
Unable to create form element

Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormElemRegenFailure
Unable to create form element

Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormCreationInvalidGeomCombination
Cannot remake form that is currently cut or joined to other geometry. Please uncut or unjoin first.

Autodesk.Revit.DB.BuiltInFailures.FormFailures.DissolveUnableToDissolveForm
Unable to dissolve form element.

Autodesk.Revit.DB.BuiltInFailures.FormFailures.DissolveNoValidInputs
No form elements selected to dissolve.

Autodesk.Revit.DB.BuiltInFailures.FormFailures.AddProfileFailure
Failed to Add Profile

Autodesk.Revit.DB.BuiltInFailures.FormFailures
Failures about Form.